In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1,2,3,4,5],[100,28,30,40,60],[1,26,89,67,45],[19787,26789,894,675,45],[17,26,89,678,450]],columns=['A0','B0','C0','D0','E0'])
df # if you dont write the column then it will set the row name be carefull here

      A0     B0   C0   D0   E0
0      1      2    3    4    5
1    100     28   30   40   60
2      1     26   89   67   45
3  19787  26789  894  675   45
4     17     26   89  678  450

In [3]:
df.shape

(5, 5)

In [4]:
df.iloc[0:2,1:3] #start from 0 go till 2,start from 1 go till 3

   B0  C0
0   2   3
1  28  30